app/Controllers/BaseController.php

    public function userdata()
    {
        $this->userModel = new UserModel();
        $id = session()->get('user_id');
        return $this->userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'