app/Controllers/GUPController.php

    public function index()
    {
        $tahun = $this->request->getVar('tahun');
        if ($tahun) {
            if (!$this->validate([
                'tahun' => 'required|max_length[4]|min_length[4]',
            ])) {
                return redirect()->to('/gup')->withInput();
            }
            $data = [
                'title' => 'Data Dokumen GUP Tahun ' . $tahun,
                'gups' => $this->gupModel->like('tanggal', $tahun)->orderBy('id', 'desc')->findAll(),
                'userdata' => $this->userdata(),
                'validation' => \Config\Services::validation(),
                'tahun' => $tahun
            ];
        } else {
            $data = [
                'title' => 'Data Dokumen GUP',
                'gups' => $this->gupModel->orderBy('id', 'desc')->findAll(),
---
SELECT *
FROM `gup`
ORDER BY `id` DESC

    public function delete($id)
    {
        $gup = $this->gupModel->find($id);
        $oldFile = $gup['file_gup'];
        if (!empty($oldFile)) {
            unlink('upload/gup/' . $oldFile);
        }
        $this->gupModel->delete($id);
---
SELECT *
FROM `gup`
WHERE `gup`.`id` = '8'
DELETE FROM `gup`
WHERE `id` IN ('8')